Revit 2017 API
StructuralSectionRectangleHSS Class
 Defines parameters for parameterized rectangle HSS structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public class StructuralSectionRectangleHSS : StructuralSectionRectangular
Visual Basic
Public Class StructuralSectionRectangleHSS _
	Inherits StructuralSectionRectangular
Visual C++
public ref class StructuralSectionRectangleHSS : public StructuralSectionRectangular
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleHSS
See Also
StructuralSectionRectangleHSS Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace